#include <iostream>
#include <vector>
#include <algorithm>
#include <string>

using namespace std;

void t4() {
    setlocale(LC_ALL, "0");
    cout << "ЗАДАНИЕ 4 - Дан список учеников и их рост. Необходимо отсортировать ФИО каждого по возрастанию.\n";
   vector<pair<string, int>> STUD = {
        {"Алексеев Алексей Алексеевич", 182},
        {"Белов Борис Борисович", 175},
        {"Васильев Василий Васильевич", 170},
        {"Григорьев Григорий Григорьевич", 178},
        {"Данилов Даниил Данилович", 173},
        {"Егоров Егор Егорович", 180},
        {"Жуков Женя Жукович", 175},
        {"Захаров Захар Захарович", 172},
        {"Иванов Иван Иванович", 175},
        {"Козлов Кирилл Козлович", 182},
        {"Лебедев Лев Лебедевич", 178},
        {"Макаров Максим Макарович", 180},
        {"Николаев Николай Николаевич", 175},
        {"Олегов Олег Олегович", 172},
        {"Павлов Павел Павлович", 180},
        {"Романов Роман Романович", 175},
        {"Сергеев Сергей Сергеевич", 178},
        {"Тимофеев Тимофей Тимофеевич", 173},
        {"Ульянов Ульян Ульянович", 180},
        {"Федоров Федор Федорович", 175},
        {"Харитонов Харитон Харитонович", 182},
        {"Цветков Цветан Цветкович", 178},
        {"Чернов Черныш Чернович", 175},
        {"Шестаков Шестак Шестакович", 172},
        {"Яковлев Яков Яковлевич", 180}};
   for (const auto& student : STUD) {
       cout << student.first << " (" << student.second << " cm)\n";
   }

    cout << "_РЕЗУЛЬТАТ:\n";

    // auto inc = STUD.begin();
    // while ( inc != STUD.end()){
    //     auto next_inc = inc;
    //     ++next_inc;
    //     if (next_inc != STUD.end() && inc->second > next_inc->second) {
    //         std::swap(inc->second, next_inc->second);}
    //     inc = next_inc; }

    sort(STUD.begin(), STUD.end(), [](const pair<string, int>& a, const pair<string, int>& b) {
        return a.second < b.second;});
    for (const auto& student : STUD) {
        cout << student.first << "\n";
    }    

 }

